Revit 2024 API
DockableFrameFocusChangedEventArgs Class
 The event arguments used by the DockableFrameActivatedChanged event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class DockableFrameFocusChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class DockableFrameFocusChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class DockableFrameFocusChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs
See Also
DockableFrameFocusChangedEventArgs Members
Autodesk.Revit.UI.Events Namespace